greeting = """
Привіт. 
Натисни на кнопку 'Книги' і в тебе з'явиться список предметів, вибери один, та бот надішле pdf файли книги з цього предмету.
Натисни на кнопку 'Розклад' та вибери, що ти хочеш побачити, розклад уроків, чи розклад дзвінків"""

books = """
Виберіть предмет, і бот надішле pdf file підручника з цього предмету."""

attention = """
УВАГА!
Файли з підручниками відправляються НЕ одразу, а протягом певного часу(в середньому 10-15 секунд, залежить від інтернету)."""

schedule_text = """
Натисни на кнопку 'Розклад дзвінків', та вибери номер уроку, або всі уроки, та бот надішле розклад дзвінків згідно з твого вибору.
Натисни на кнопку 'Розклад уроків' та вибери день, або розклад всіх уроків, та бот надішле розклад уроків згідно з твого вибору."""

lessons_orders_text = """
Вибери день тижня, або вибери весь розклад, та бот надішле розклад уроків згідно з твого вибору."""

timetable_text = """
Виберіть номер уроку, або всі уроки, та бот надішле розклад дзвінкі згідно з твого вибору."""

exit = "Головне меню"

# Назва предметів

alg = "Алгебра"
geom = "Геометрія"
phys = "Фізика"
ukr_lang = "Українська мова"
ukr_lit = "Українська література"
world_lit = "Зарубіжна література"
biol = "Біологія"
chem = "Хімія"
geography = "Географія"
world_hist = "Всесвітня історія"
ukr_hist = "Історія України"
it = "Інформатика"
health = "Основи здоров'я"
juris = "Правознавство"

# Підручники

alg_book = open("books/Algebra.pdf", "rb")
geom_book = open("books/Geometry.pdf", "rb")
phys_book = open("books/Physics.pdf", "rb")
ukr_lang_book = open("books/Ukr_lang.pdf", "rb")
ukr_lit_book = open("books/Ukr_lit.pdf", "rb")
world_lit_book = open("books/World_lit.pdf", "rb")
biol_book = open("books/Biology.pdf", "rb")
chem_book = open("books/Chemistry.pdf", "rb")
geography_book = open("books/Geography.pdf", "rb")
world_hist_book = open("books/World_history.pdf", "rb")
ukr_hist_book = open("books/Ukr_history.pdf", "rb")
it_book = open("books/It.pdf", "rb")
health_book = open("books/Health_basic.pdf", "rb")
jurisprudence_book = open("books/Jurisprudence.pdf", "rb")

# Назва днів тижня

monday = "Понеділок"
tuesday = "Вівторок"
wednesday = "Середа"
thursday = "Четвер"
friday = "П'ятниця"
saturday = "Субота"

# Розклад уроків

monday_sub = """<b>Понеділок:</b>
1) Фізкультура
2) Біологія
3) Українська мова
4) Українська мова
5) Геометрія
6) Трудове навчання
7) Зарубіжна література
"""

tuesday_sub = """<b>Вівторок:</b>
1) Алгебра
2) Географія
3) Зарубіжна література
4) Граматика англійською
5) Алгебра
6) Фізика англійською
"""

wednesday_sub = """<b>Середа:</b>
1) Геометрія
2) Хімія
3) Інформатика
4) Країнознавство Великої Британії
5) Фізика
6) Граматика англійською
7) Українська література
"""

thursday_sub = """<b>Четвер:</b>
1) Історія України
2) Лексика англійською
3) Лексика англійською
4) Алгебра
5) Біологія
6) ФІзика
7) Географія
"""

friday_sub = """<b>П'ятниця:</b>
1) Правознавство
2) Хімія
3) Лексика англійською
4) Алгебра
5) Українська література
6) Література Великої Британаї
7) Фізкультура
"""

saturday_sub = """<b>Субота:</b>
1) 
2) 
3) 
4) Всесвітня історія
5) Основи здоров'я
"""

full_lessons_schedule = f"""
{monday_sub}
{tuesday_sub}
{wednesday_sub}
{thursday_sub}
{friday_sub}
{saturday_sub}"""

# Розклад дзвіну кожного уроку

lesson_1 = """<u><b>1 Урок</b></u>
8:30 -- 9:15

<i>Перерва(15)</i>
9:15 -- 9:30"""

lesson_2 = """<u><b>2 Урок</b></u>
9:30 -- 10:15

<i>Перерва(15)</i>   
10:15 -- 10:30"""

lesson_3 = """<u><b>3 Урок</b></u>
10:30 -- 11:15

<i>Перерва(20)</i>   
11:15 -- 11:35"""

lesson_4 = """<u><b>4 Урок</b></u>
11:35 -- 12:20

<i>Перерва(20)</i>   
12:20 -- 12:40"""

lesson_5 = """<u><b>5 Урок</b></u>
12:40 -- 13:25

<i>Перерва(10)</i>   
13:25 -- 13:35"""

lesson_6 = """<u><b>6 Урок</b></u>
13:35 -- 14:20

<i>Перерва(10)</i>   
14:20 -- 14:30"""

lesson_7 = """<u><b>7 Урок</b></u>
14:30 -- 15:15"""

# Розклад всіх дзвінків

time_table = """
<u><b>1 Урок</b></u>            8:30 -- 9:15
<i>Перерва(15)</i>   9:15 -- 9:30 

<u><b>2 Урок</b></u>            9:30 -- 10:15 
<i>Перерва(15)</i>   10:15 -- 10:30

<u><b>3 Урок</b></u>            10:30 -- 11:15
<i>Перерва(20)</i>   11:15 -- 11:35

<u><b>4 Урок</b></u>            11:35 -- 12:20
<i>Перерва(20)</i>   12:30 -- 12:50

<u><b>5 Урок</b></u>            12:40 -- 13:25
<i>Перерва(10)</i>   13:25 -- 13:35

<u><b>6 Урок</b></u>           13:35 -- 14:20
<i>Перерва(10)</i> 14:20 -- 14:30

<u><b>7 Урок</b></u>           14:30 -- 15:15"""
