greeting = """
Привіт. 
Натисни на кнопку 'Книги' і в тебе з'явиться список предметів, вибери один, та бот надішле pdf файли книги з цього предмету.
Натисни на кнопку 'Розклад' та вибери, що ти хочеш побачити, розклад уроків, чи розклад дзвінків"""

books = """
Виберіть предмет, і бот надішле pdf file підручника з цього предмету."""

attention = """
УВАГА!
Файли з підручниками відправляються НЕ одразу, а протягом певного часу(в середньому 10-15 секунд, залежить від інтернету)."""

schedule_text = """
Натисни на кнопку 'Розклад дзвінків', та вибери номер уроку, або всі уроки, та бот надішле розклад дзвінків згідно з твого вибору.
Натисни на кнопку 'Розклад уроків' та вибери день, або розклад всіх уроків, та бот надішле розклад уроків згідно з твого вибору."""


group_choice_text = "Виберіть вашу групу, будь ласка."
group_choice = None

lessons_orders_text_1 = """
Вибери день тижня, або вибери весь розклад, та бот надішле розклад уроків згідно з твого вибору.
---------------------------------------
<b>УВАГА! ЦЕ РОЗКЛАД ДЛЯ 1 ГРУПИ</b>.
---------------------------------------
"""

lessons_orders_text_2 = """
Вибери день тижня, або вибери весь розклад, та бот надішле розклад уроків згідно з твого вибору.
---------------------------------------
<b>УВАГА! ЦЕ РОЗКЛАД ДЛЯ 2 ГРУПИ</b>.
---------------------------------------
"""

timetable_text = """
Виберіть номер уроку, або всі уроки, та бот надішле розклад дзвінкі згідно з твого вибору."""

exit = "Головне меню"

# Назва предметів

alg = "Алгебра"
geom = "Геометрія"
phys = "Фізика"
ukr_lang = "Українська мова"
ukr_lit = "Українська література"
world_lit = "Зарубіжна література"
biol = "Біологія"
chem = "Хімія"
geography = "Географія"
world_hist = "Всесвітня історія"
ukr_hist = "Історія України"
it = "Інформатика"
health = "Основи здоров'я"
juris = "Правознавство"

another_books_caption = "Нам видавали інший підручник, але саме цей вчитель виклав у гугл клас, тому ми скоріш за все будемо вчитися саме по такому підручнику."
# Назва днів тижня

monday = "Понеділок"
tuesday = "Вівторок"
wednesday = "Середа"
thursday = "Четвер"
friday = "П'ятниця"
saturday = "Субота"

# Розклад уроків для 1 групи

monday_sub_1 = """<b>Понеділок(1 група):</b>
1) Алгебра
2) Lexic
3) Фізкультура
4) Українська література
5) Українська література
6) Географія
7) Алгебра лекція
"""

tuesday_sub_1 = """<b>Вівторок(1 група):</b>
1) Хімія
2) Інформатика
3) Геометрія
4) Grammar
5) Українська мова
6) Фізика
"""

wednesday_sub_1 = """<b>Середа(1 група):</b>
1) Фізкультура
2) Lexic
3) Література Великої Британії
4) Країнознавство Великої Британії
5) Біологія
6) історія України
7) Біологія
"""

thursday_sub_1 = """<b>Четвер(1 група):</b>
1) Українська мова
2) Grammar
3) Хімія
4) Алгебра
5) Алгебра
6) Lexic
7) Фізика англійської мовою
"""

friday_sub_1 = """<b>П'ятниця(1 група):</b>
1) Географія
2) Всесвітня історія
3) Фізика
4) Геометрія
5) Трудове навчання
6) Зар літ
7) Зар літ
"""

saturday_sub = """<b>Субота:</b>
1) Правознавство
2) Основи здоров'я
"""

full_lessons_schedule_1 = f"""
{monday_sub_1}
{tuesday_sub_1}
{wednesday_sub_1}
{thursday_sub_1}
{friday_sub_1}
{saturday_sub}"""

# Розклад уроків для 2 групи

monday_sub_2 = """<b>Понеділок(2 група):</b>
1) Lexic
2) Алгебра
3) Фізкультура
4) Українська література
5) Українська література
6) Географія
7) Алгебра лекція
"""

tuesday_sub_2 = """<b>Вівторок(2 група):</b>
1) Хімія
2) Геометрія
3) Інформатика
4) Українська мова
5) Grammar
6) Фізика англ. мовою
"""

wednesday_sub_2 = """<b>Середа(2 група):</b>
1) Фізкультура
2) Алгебра
3) Країнознавство Великої Британії
4) Література Великої Британії
5) Біологія
6) історія України
7) Біологія
"""

thursday_sub_2 = """<b>Четвер(2 група):</b>
1) Grammar
2) Українська мова
3) Хімія
4) Англійська мова
5) Англійська мова
6) Алгебра
7) Фізика
"""

friday_sub_2 = """<b>П'ятниця(2 група):</b>
1) Географія
2) Всесвітня історія
3) Геометрія
4) Фізика
5) Трудове навчання
6) Зар літ
7) Зар літ
"""

full_lessons_schedule_2 = f"""
{monday_sub_2}
{tuesday_sub_2}
{wednesday_sub_2}
{thursday_sub_2}
{friday_sub_2}
{saturday_sub}"""

# Розклад дзвіну кожного уроку

lesson_1 = """<u><b>1 Урок</b></u>
8:30 -- 9:15

<i>Перерва(15)</i>
9:15 -- 9:30"""

lesson_2 = """<u><b>2 Урок</b></u>
9:30 -- 10:15

<i>Перерва(15)</i>   
10:15 -- 10:30"""

lesson_3 = """<u><b>3 Урок</b></u>
10:30 -- 11:15

<i>Перерва(20)</i>   
11:15 -- 11:35"""

lesson_4 = """<u><b>4 Урок</b></u>
11:35 -- 12:20

<i>Перерва(20)</i>   
12:20 -- 12:40"""

lesson_5 = """<u><b>5 Урок</b></u>
12:40 -- 13:25

<i>Перерва(10)</i>   
13:25 -- 13:35"""

lesson_6 = """<u><b>6 Урок</b></u>
13:35 -- 14:20

<i>Перерва(10)</i>   
14:20 -- 14:30"""

lesson_7 = """<u><b>7 Урок</b></u>
14:30 -- 15:15"""

# Розклад всіх дзвінків

time_table = """
<u><b>1 Урок</b></u>            8:30 -- 9:15
<i>Перерва(15)</i>   9:15 -- 9:30 

<u><b>2 Урок</b></u>            9:30 -- 10:15 
<i>Перерва(15)</i>   10:15 -- 10:30

<u><b>3 Урок</b></u>            10:30 -- 11:15
<i>Перерва(20)</i>   11:15 -- 11:35

<u><b>4 Урок</b></u>            11:35 -- 12:20
<i>Перерва(20)</i>   12:30 -- 12:50

<u><b>5 Урок</b></u>            12:40 -- 13:25
<i>Перерва(10)</i>   13:25 -- 13:35

<u><b>6 Урок</b></u>           13:35 -- 14:20
<i>Перерва(10)</i> 14:20 -- 14:30

<u><b>7 Урок</b></u>           14:30 -- 15:15"""